Tekla Open API Reference for Tekla Structures 2025
NullRulingException Class
 This class represent an exception thrown when a ruling of the lofted plate (i.e. the lines that swipe the plate surface between the base curves) would become zero because of a lofted plate operation
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.LoftedPlateOperationException
 Tekla.Structures.Model.NullRulingException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class NullRulingException : LoftedPlateOperationException
Public Class NullRulingException
	Inherits LoftedPlateOperationException
The NullRulingException type exposes the following members.
Constructors
Name | Description
NullRulingException
 Constructs an instance of the class
Top
See Also
Reference
Tekla.Structures.Model Namespace